<?php

namespace Database\Seeders;

use App\Models\City;
use Illuminate\Database\Seeder;

class CitySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $entries= '[
            {
                "id": "1",
                "state_id": "1",
                "name": "السلام"
            },
            {
                "id": "2",
                "state_id": "1",
                "name": "العباسيه والظاهر"
            },
            {
                "id": "3",
                "state_id": "1",
                "name": "المرج وعزبة النخل"
            },
            {
                "id": "4",
                "state_id": "1",
                "name": "النهضة"
            },
            {
                "id": "5",
                "state_id": "1",
                "name": "حلمية الزيتون"
            },
            {
                "id": "6",
                "state_id": "1",
                "name": "المطريه"
            },
            {
                "id": "7",
                "state_id": "1",
                "name": "روض الفرج"
            },
            {
                "id": "8",
                "state_id": "1",
                "name": "الشرابية"
            },
            {
                "id": "9",
                "state_id": "1",
                "name": "شبرا مصر"
            },
            {
                "id": "10",
                "state_id": "1",
                "name": "مدينة نصر شرق"
            },
            {
                "id": "11",
                "state_id": "1",
                "name": "مدينة نصر غرب"
            },
            {
                "id": "12",
                "state_id": "1",
                "name": "شروق مدينة نصر"
            },
            {
                "id": "13",
                "state_id": "1",
                "name": "مصر الجديدة والنزهة"
            },
            {
                "id": "14",
                "state_id": "1",
                "name": "جمعية أحمد عرابي"
            },
            {
                "id": "15",
                "state_id": "1",
                "name": "كبار المشتركين"
            },
            {
                "id": "16",
                "state_id": "1",
                "name": "البساتين (1)"
            },
            {
                "id": "17",
                "state_id": "1",
                "name": "البساتين (2)"
            },
            {
                "id": "18",
                "state_id": "1",
                "name": "السيدة زينب"
            },
            {
                "id": "19",
                "state_id": "1",
                "name": "القلعه"
            },
            {
                "id": "20",
                "state_id": "1",
                "name": "المعادي (1)"
            },
            {
                "id": "21",
                "state_id": "1",
                "name": "المعادي (2)"
            },
            {
                "id": "22",
                "state_id": "1",
                "name": "دار السلام"
            },
            {
                "id": "23",
                "state_id": "1",
                "name": "المقطم (أ)"
            },
            {
                "id": "24",
                "state_id": "1",
                "name": "المقطم(ب)"
            },
            {
                "id": "25",
                "state_id": "1",
                "name": "حلوان"
            },
            {
                "id": "26",
                "state_id": "1",
                "name": "غرب القاهرة"
            },
            {
                "id": "27",
                "state_id": "2",
                "name": "الجيزة"
            },
            {
                "id": "28",
                "state_id": "2",
                "name": "العمرانية (1)"
            },
            {
                "id": "29",
                "state_id": "2",
                "name": "العمرانية (2)"
            },
            {
                "id": "30",
                "state_id": "2",
                "name": "الطالبية (1)"
            },
            {
                "id": "31",
                "state_id": "2",
                "name": "الطالبية(2)"
            },
            {
                "id": "32",
                "state_id": "2",
                "name": "نصر الدين"
            },
            {
                "id": "33",
                "state_id": "2",
                "name": "الدقي"
            },
            {
                "id": "34",
                "state_id": "2",
                "name": "المهندسين"
            },
            {
                "id": "35",
                "state_id": "2",
                "name": "امبابه"
            },
            {
                "id": "36",
                "state_id": "2",
                "name": "الوراق (1)"
            },
            {
                "id": "37",
                "state_id": "2",
                "name": "الوراق (2)"
            },
            {
                "id": "38",
                "state_id": "2",
                "name": "المنيرة الغربية"
            },
            {
                "id": "39",
                "state_id": "2",
                "name": "بشتيل (1)"
            },
            {
                "id": "40",
                "state_id": "2",
                "name": "بشتيل (2)"
            },
            {
                "id": "41",
                "state_id": "2",
                "name": "بولاق (1)"
            },
            {
                "id": "42",
                "state_id": "2",
                "name": "بولاق (2)"
            },
            {
                "id": "43",
                "state_id": "2",
                "name": "فيصل (1)"
            },
            {
                "id": "44",
                "state_id": "2",
                "name": "فيصل (2)"
            },
            {
                "id": "45",
                "state_id": "2",
                "name": "الصف"
            },
            {
                "id": "46",
                "state_id": "2",
                "name": "العياط"
            },
            {
                "id": "47",
                "state_id": "2",
                "name": "المنصورية"
            },
            {
                "id": "48",
                "state_id": "2",
                "name": "الواحات"
            },
            {
                "id": "49",
                "state_id": "2",
                "name": "أطفيح"
            },
            {
                "id": "50",
                "state_id": "2",
                "name": "أوسيم (1)"
            },
            {
                "id": "51",
                "state_id": "2",
                "name": "أوسيم (2)"
            },
            {
                "id": "52",
                "state_id": "2",
                "name": "كرداسة"
            },
            {
                "id": "53",
                "state_id": "2",
                "name": "منشاة القناطر"
            },
            {
                "id": "54",
                "state_id": "2",
                "name": "وردان"
            },
            {
                "id": "55",
                "state_id": "3",
                "name": "البيطاش"
            },
            {
                "id": "56",
                "state_id": "3",
                "name": "بيانكي"
            },
            {
                "id": "57",
                "state_id": "3",
                "name": "الساحل الشمالي"
            },
            {
                "id": "58",
                "state_id": "3",
                "name": "برج العرب القديم"
            },
            {
                "id": "59",
                "state_id": "3",
                "name": "الحمام"
            },
            {
                "id": "60",
                "state_id": "3",
                "name": "الهانوفيل"
            },
            {
                "id": "61",
                "state_id": "3",
                "name": "خورشيد البحرية"
            },
            {
                "id": "62",
                "state_id": "3",
                "name": "خورشيد القبلية"
            },
            {
                "id": "63",
                "state_id": "3",
                "name": "أبو قير"
            },
            {
                "id": "64",
                "state_id": "3",
                "name": "سيدي بشر"
            },
            {
                "id": "65",
                "state_id": "3",
                "name": "المندرة"
            },
            {
                "id": "66",
                "state_id": "3",
                "name": "الإبراهيمية"
            },
            {
                "id": "67",
                "state_id": "3",
                "name": "النصر"
            },
            {
                "id": "68",
                "state_id": "3",
                "name": "محرم بك"
            },
            {
                "id": "69",
                "state_id": "3",
                "name": "وسط المدينة"
            },
            {
                "id": "70",
                "state_id": "3",
                "name": "سموحة"
            },
            {
                "id": "71",
                "state_id": "3",
                "name": "أبيس"
            },
            {
                "id": "72",
                "state_id": "3",
                "name": "باكوس"
            },
            {
                "id": "73",
                "state_id": "3",
                "name": "السيوف"
            },
            {
                "id": "74",
                "state_id": "3",
                "name": "سابا باشا"
            },
            {
                "id": "75",
                "state_id": "3",
                "name": "الجلاء"
            },
            {
                "id": "76",
                "state_id": "3",
                "name": "الدخيلة"
            },
            {
                "id": "77",
                "state_id": "3",
                "name": "العامرية"
            },
            {
                "id": "78",
                "state_id": "3",
                "name": "القباري"
            },
            {
                "id": "79",
                "state_id": "3",
                "name": "مرغم"
            },
            {
                "id": "80",
                "state_id": "12",
                "name": "الخانكة"
            },
            {
                "id": "81",
                "state_id": "12",
                "name": "الخصوص"
            },
            {
                "id": "82",
                "state_id": "12",
                "name": "العبور"
            },
            {
                "id": "83",
                "state_id": "12",
                "name": "القناطر الخيرية"
            },
            {
                "id": "84",
                "state_id": "12",
                "name": "بهتيم"
            },
            {
                "id": "85",
                "state_id": "12",
                "name": "شبرا الخيمة"
            },
            {
                "id": "86",
                "state_id": "12",
                "name": "قري الخانكه"
            },
            {
                "id": "87",
                "state_id": "12",
                "name": "شبين القناطر"
            },
            {
                "id": "88",
                "state_id": "12",
                "name": "طوخ"
            },
            {
                "id": "89",
                "state_id": "12",
                "name": "قها"
            },
            {
                "id": "90",
                "state_id": "12",
                "name": "كفر شكر"
            },
            {
                "id": "91",
                "state_id": "12",
                "name": "مدينة بنها"
            },
            {
                "id": "92",
                "state_id": "12",
                "name": "مركز بنها"
            },
            {
                "id": "93",
                "state_id": "12",
                "name": "قليوب"
            },
            {
                "id": "94",
                "state_id": "12",
                "name": "مركز قليوب"
            },
            {
                "id": "95",
                "state_id": "27",
                "name": "العسيرات"
            },
            {
                "id": "96",
                "state_id": "27",
                "name": "مدينة المراغة"
            },
            {
                "id": "97",
                "state_id": "27",
                "name": "المنشاة"
            },
            {
                "id": "98",
                "state_id": "27",
                "name": "أخميم"
            },
            {
                "id": "99",
                "state_id": "27",
                "name": "شمال البلينا"
            },
            {
                "id": "100",
                "state_id": "27",
                "name": "جنوب البلينا"
            },
            {
                "id": "101",
                "state_id": "27",
                "name": "جهينة"
            },
            {
                "id": "102",
                "state_id": "27",
                "name": "دار السلام"
            },
            {
                "id": "103",
                "state_id": "27",
                "name": "ساقلته"
            },
            {
                "id": "104",
                "state_id": "27",
                "name": "طما"
            },
            {
                "id": "105",
                "state_id": "27",
                "name": "مدينة جرجا"
            },
            {
                "id": "106",
                "state_id": "27",
                "name": "مركز جرجا"
            },
            {
                "id": "107",
                "state_id": "27",
                "name": "مدينة سوهاج شرق"
            },
            {
                "id": "108",
                "state_id": "27",
                "name": "مدينة سوهاج غرب"
            },
            {
                "id": "109",
                "state_id": "27",
                "name": "مركز سوهاج جنوب"
            },
            {
                "id": "110",
                "state_id": "27",
                "name": "مركز سوهاج شمال"
            },
            {
                "id": "111",
                "state_id": "27",
                "name": "مدينة طهطا"
            },
            {
                "id": "112",
                "state_id": "27",
                "name": "مركز طهطا"
            },
            {
                "id": "113",
                "state_id": "22",
                "name": "الحامول مدينة"
            },
            {
                "id": "114",
                "state_id": "22",
                "name": "الرياض"
            },
            {
                "id": "115",
                "state_id": "22",
                "name": "بلطيم"
            },
            {
                "id": "116",
                "state_id": "22",
                "name": "بيلا"
            },
            {
                "id": "117",
                "state_id": "22",
                "name": "سيدي سالم قري"
            },
            {
                "id": "118",
                "state_id": "22",
                "name": "فوة"
            },
            {
                "id": "119",
                "state_id": "22",
                "name": "كفر الشيخ مدينة"
            },
            {
                "id": "120",
                "state_id": "22",
                "name": "الحامول قري"
            },
            {
                "id": "121",
                "state_id": "22",
                "name": "الكراكات"
            },
            {
                "id": "122",
                "state_id": "22",
                "name": "برج البرلس"
            },
            {
                "id": "123",
                "state_id": "22",
                "name": "دسوق قري جنوب"
            },
            {
                "id": "124",
                "state_id": "22",
                "name": "دسوق قري شمال"
            },
            {
                "id": "125",
                "state_id": "22",
                "name": "دسوق مدينة"
            },
            {
                "id": "126",
                "state_id": "22",
                "name": "سيدي سالم مدينة"
            },
            {
                "id": "127",
                "state_id": "22",
                "name": "قلين"
            },
            {
                "id": "128",
                "state_id": "22",
                "name": "كفر الشيخ قري شرق"
            },
            {
                "id": "129",
                "state_id": "22",
                "name": "كفر الشيخ قري غرب"
            },
            {
                "id": "130",
                "state_id": "22",
                "name": "مطوبس"
            },
            {
                "id": "131",
                "state_id": "10",
                "name": "الباجور"
            },
            {
                "id": "132",
                "state_id": "10",
                "name": "الشهداء"
            },
            {
                "id": "133",
                "state_id": "10",
                "name": "بركة السبع"
            },
            {
                "id": "134",
                "state_id": "10",
                "name": "تلا"
            },
            {
                "id": "135",
                "state_id": "10",
                "name": "سرس الليان"
            },
            {
                "id": "136",
                "state_id": "10",
                "name": "قويسنا شرق"
            },
            {
                "id": "137",
                "state_id": "10",
                "name": "قويسنا غرب"
            },
            {
                "id": "138",
                "state_id": "10",
                "name": "أشمون "
            },
            {
                "id": "139",
                "state_id": "10",
                "name": "شبين الكوم"
            },
            {
                "id": "140",
                "state_id": "10",
                "name": "مركز أشمون"
            },
            {
                "id": "141",
                "state_id": "10",
                "name": "مركز شبين الكوم"
            },
            {
                "id": "142",
                "state_id": "10",
                "name": "منوف"
            },
            {
                "id": "143",
                "state_id": "15",
                "name": "ادفو"
            },
            {
                "id": "144",
                "state_id": "15",
                "name": "أسوان جنوب"
            },
            {
                "id": "145",
                "state_id": "15",
                "name": "أسوان شرق"
            },
            {
                "id": "146",
                "state_id": "15",
                "name": "أسوان شمال"
            },
            {
                "id": "147",
                "state_id": "15",
                "name": "أبو سمبل السياحية"
            },
            {
                "id": "148",
                "state_id": "15",
                "name": "دراو"
            },
            {
                "id": "149",
                "state_id": "15",
                "name": "كوم امبو"
            },
            {
                "id": "150",
                "state_id": "15",
                "name": "نصر النوبة"
            },
            {
                "id": "151",
                "state_id": "21",
                "name": "قطاع شبكات جنوب سيناء"
            },
            {
                "id": "152",
                "state_id": "21",
                "name": "هندسه ابورديس"
            },
            {
                "id": "153",
                "state_id": "21",
                "name": "هندسة دهب"
            },
            {
                "id": "154",
                "state_id": "21",
                "name": "هندسة رأس سدر"
            },
            {
                "id": "155",
                "state_id": "21",
                "name": "هندسة شرم الشيخ"
            },
            {
                "id": "156",
                "state_id": "21",
                "name": "هندسة طابا"
            },
            {
                "id": "157",
                "state_id": "21",
                "name": "هندسة طور سيناء"
            },
            {
                "id": "158",
                "state_id": "21",
                "name": "هندسة كاترين"
            },
            {
                "id": "159",
                "state_id": "21",
                "name": "هندسة نويبع"
            },
            {
                "id": "160",
                "state_id": "18",
                "name": "قطاع شبكات بورسعيد"
            },
            {
                "id": "161",
                "state_id": "18",
                "name": "هندسة بورسعيد"
            },
            {
                "id": "162",
                "state_id": "18",
                "name": "هندسة الجنوب والضواحي"
            },
            {
                "id": "163",
                "state_id": "18",
                "name": "هندسة الزهور"
            },
            {
                "id": "164",
                "state_id": "18",
                "name": "هندسة المناخ"
            },
            {
                "id": "165",
                "state_id": "18",
                "name": "هندسة بورفؤاد"
            },
            {
                "id": "166",
                "state_id": "13",
                "name": "الخارجة"
            },
            {
                "id": "167",
                "state_id": "13",
                "name": "الداخلة"
            },
            {
                "id": "168",
                "state_id": "13",
                "name": "العوينات"
            },
            {
                "id": "169",
                "state_id": "13",
                "name": "باريس"
            },
            {
                "id": "170",
                "state_id": "13",
                "name": "بلاط"
            },
            {
                "id": "171",
                "state_id": "13",
                "name": "الفرافره"
            },
            {
                "id": "172",
                "state_id": "9",
                "name": "قطاع شبكات الاسماعيلية"
            },
            {
                "id": "173",
                "state_id": "9",
                "name": "هندسة الاسماعيلية أول"
            },
            {
                "id": "174",
                "state_id": "9",
                "name": "هندسة الأسماعيلية ثاني"
            },
            {
                "id": "175",
                "state_id": "9",
                "name": "هندسة أبو صوير"
            },
            {
                "id": "176",
                "state_id": "9",
                "name": "هندسة أبو عطوة"
            },
            {
                "id": "177",
                "state_id": "9",
                "name": "هندسة التل الكبير"
            },
            {
                "id": "178",
                "state_id": "9",
                "name": "هندسة الشيخ زايد"
            },
            {
                "id": "179",
                "state_id": "9",
                "name": "هندسة الفردان"
            },
            {
                "id": "180",
                "state_id": "9",
                "name": "هندسة القصاصين"
            },
            {
                "id": "181",
                "state_id": "9",
                "name": "هندسة القنطرة غرب"
            },
            {
                "id": "182",
                "state_id": "9",
                "name": "هندسة القنطرة شرق"
            },
            {
                "id": "183",
                "state_id": "9",
                "name": "هندسة المستقبل"
            },
            {
                "id": "184",
                "state_id": "9",
                "name": "هندسة الملاك"
            },
            {
                "id": "185",
                "state_id": "9",
                "name": "هندسة شرق البحيرات"
            },
            {
                "id": "186",
                "state_id": "9",
                "name": "هندسة فايد"
            },
            {
                "id": "187",
                "state_id": "6",
                "name": "بنجر السكر"
            },
            {
                "id": "188",
                "state_id": "6",
                "name": "البستان"
            },
            {
                "id": "189",
                "state_id": "6",
                "name": "التحدي"
            },
            {
                "id": "190",
                "state_id": "6",
                "name": "التحرير بدر"
            },
            {
                "id": "191",
                "state_id": "6",
                "name": "الدلنجات"
            },
            {
                "id": "192",
                "state_id": "6",
                "name": "الدواجن"
            },
            {
                "id": "193",
                "state_id": "6",
                "name": "الرحمانية"
            },
            {
                "id": "194",
                "state_id": "6",
                "name": "الصفا والمروة"
            },
            {
                "id": "195",
                "state_id": "6",
                "name": "المحمودية"
            },
            {
                "id": "196",
                "state_id": "6",
                "name": "النصر 3"
            },
            {
                "id": "197",
                "state_id": "6",
                "name": "إدفينا"
            },
            {
                "id": "198",
                "state_id": "6",
                "name": "إدكو"
            },
            {
                "id": "199",
                "state_id": "6",
                "name": "إيتاي البارود"
            },
            {
                "id": "200",
                "state_id": "6",
                "name": "أبو المطامير"
            },
            {
                "id": "201",
                "state_id": "6",
                "name": "أبو بكر"
            },
            {
                "id": "202",
                "state_id": "6",
                "name": "أبو حمص شرق"
            },
            {
                "id": "203",
                "state_id": "6",
                "name": "أبو حمص غرب"
            },
            {
                "id": "204",
                "state_id": "6",
                "name": "أحمد بدوي"
            },
            {
                "id": "205",
                "state_id": "6",
                "name": "بندر دمنهور شرق"
            },
            {
                "id": "206",
                "state_id": "6",
                "name": "بندر دمنهور غرب"
            },
            {
                "id": "207",
                "state_id": "6",
                "name": "بندر كفر الدوار شرق"
            },
            {
                "id": "208",
                "state_id": "6",
                "name": "بندر كفر الدوار غرب"
            },
            {
                "id": "209",
                "state_id": "6",
                "name": "حوش عيسي"
            },
            {
                "id": "210",
                "state_id": "6",
                "name": "رشيد"
            },
            {
                "id": "211",
                "state_id": "6",
                "name": "سيدي غازي"
            },
            {
                "id": "212",
                "state_id": "6",
                "name": "شبراخيت"
            },
            {
                "id": "213",
                "state_id": "6",
                "name": "شمال التحرير"
            },
            {
                "id": "214",
                "state_id": "6",
                "name": "غرب النوبارية"
            },
            {
                "id": "215",
                "state_id": "6",
                "name": "كفر داود"
            },
            {
                "id": "216",
                "state_id": "6",
                "name": "كوم حمادة"
            },
            {
                "id": "217",
                "state_id": "6",
                "name": "مركز دمنهور"
            },
            {
                "id": "218",
                "state_id": "6",
                "name": "مركز كفر الدوار"
            },
            {
                "id": "219",
                "state_id": "6",
                "name": "مريوط"
            },
            {
                "id": "220",
                "state_id": "6",
                "name": "وداي النطرون"
            },
            {
                "id": "221",
                "state_id": "8",
                "name": "السنطة"
            },
            {
                "id": "222",
                "state_id": "8",
                "name": "أول المحلة"
            },
            {
                "id": "223",
                "state_id": "8",
                "name": "أول طنطا"
            },
            {
                "id": "224",
                "state_id": "8",
                "name": "بسيون"
            },
            {
                "id": "225",
                "state_id": "8",
                "name": "بشبيش"
            },
            {
                "id": "226",
                "state_id": "8",
                "name": "ثاني المحلة"
            },
            {
                "id": "227",
                "state_id": "8",
                "name": "ثاني طنطا"
            },
            {
                "id": "228",
                "state_id": "8",
                "name": "زفتي"
            },
            {
                "id": "229",
                "state_id": "8",
                "name": "سمنود"
            },
            {
                "id": "230",
                "state_id": "8",
                "name": "قطور"
            },
            {
                "id": "231",
                "state_id": "8",
                "name": "كفر الزيات"
            },
            {
                "id": "232",
                "state_id": "8",
                "name": "مركز المحلة"
            },
            {
                "id": "233",
                "state_id": "8",
                "name": "مركز طنطا"
            },
            {
                "id": "234",
                "state_id": "20",
                "name": "قطاع شبكات شمال الشرقية"
            },
            {
                "id": "235",
                "state_id": "20",
                "name": "هندسة أبو كبير"
            },
            {
                "id": "236",
                "state_id": "20",
                "name": "هندسة الحسينية"
            },
            {
                "id": "237",
                "state_id": "20",
                "name": "هندسة الخطارة"
            },
            {
                "id": "238",
                "state_id": "20",
                "name": "هندسة أولاد صقر"
            },
            {
                "id": "239",
                "state_id": "20",
                "name": "هندسة صان الحجر"
            },
            {
                "id": "240",
                "state_id": "20",
                "name": "هندسة فاقوس"
            },
            {
                "id": "241",
                "state_id": "20",
                "name": "هندسة كفر صقر"
            },
            {
                "id": "242",
                "state_id": "20",
                "name": "هندسة ههيا"
            },
            {
                "id": "243",
                "state_id": "20",
                "name": "قطاع شبكات وسط الشرقية"
            },
            {
                "id": "244",
                "state_id": "20",
                "name": "هندسة ابو حماد"
            },
            {
                "id": "245",
                "state_id": "20",
                "name": "هندسة القرين"
            },
            {
                "id": "246",
                "state_id": "20",
                "name": "هندسة القنايات"
            },
            {
                "id": "247",
                "state_id": "20",
                "name": "هندسة جامعة الزقازيق"
            },
            {
                "id": "248",
                "state_id": "20",
                "name": "هندسة شرق الزقازيق"
            },
            {
                "id": "249",
                "state_id": "20",
                "name": "هندسة غرب الزقازيق"
            },
            {
                "id": "250",
                "state_id": "20",
                "name": "هندسة قري الزقازيق"
            },
            {
                "id": "251",
                "state_id": "20",
                "name": "هندسة وسط الزقازيق"
            },
            {
                "id": "252",
                "state_id": "20",
                "name": "قطاع شبكات جنوب الشرقية"
            },
            {
                "id": "253",
                "state_id": "20",
                "name": "هندسة الابراهيمية"
            },
            {
                "id": "254",
                "state_id": "20",
                "name": "هندسة البر الشرقي"
            },
            {
                "id": "255",
                "state_id": "20",
                "name": "هندسة أنشاص"
            },
            {
                "id": "256",
                "state_id": "20",
                "name": "هندسة بلبيس"
            },
            {
                "id": "257",
                "state_id": "20",
                "name": "هندسة ديرب نجم"
            },
            {
                "id": "258",
                "state_id": "20",
                "name": "هندسة شرق منيا القمح"
            },
            {
                "id": "259",
                "state_id": "20",
                "name": "هندسة غرب منيا القمح"
            },
            {
                "id": "260",
                "state_id": "20",
                "name": "هندسة مشتول السوق"
            },
            {
                "id": "261",
                "state_id": "26",
                "name": "قطاع شبكات شمال سيناء"
            },
            {
                "id": "262",
                "state_id": "26",
                "name": "هندسة الحسنه"
            },
            {
                "id": "263",
                "state_id": "26",
                "name": "هندسة الشيخ زويد"
            },
            {
                "id": "264",
                "state_id": "26",
                "name": "هندسة العريش"
            },
            {
                "id": "265",
                "state_id": "26",
                "name": "هندسة المساعيد"
            },
            {
                "id": "266",
                "state_id": "26",
                "name": "هندسة بئر العبد"
            },
            {
                "id": "267",
                "state_id": "26",
                "name": "هندسة رفح"
            },
            {
                "id": "268",
                "state_id": "26",
                "name": "هندسة رمانة"
            },
            {
                "id": "269",
                "state_id": "26",
                "name": "هندسة نخل"
            },
            {
                "id": "270",
                "state_id": "16",
                "name": "الشئون التجارية المركزية"
            },
            {
                "id": "271",
                "state_id": "16",
                "name": "ابنوب"
            },
            {
                "id": "272",
                "state_id": "16",
                "name": "ابو تيج"
            },
            {
                "id": "273",
                "state_id": "16",
                "name": "البداري"
            },
            {
                "id": "274",
                "state_id": "16",
                "name": "الغنايم"
            },
            {
                "id": "275",
                "state_id": "16",
                "name": "الفتح"
            },
            {
                "id": "276",
                "state_id": "16",
                "name": "القوصية"
            },
            {
                "id": "277",
                "state_id": "16",
                "name": "المركز بحري"
            },
            {
                "id": "278",
                "state_id": "16",
                "name": "المركز جنوب"
            },
            {
                "id": "279",
                "state_id": "16",
                "name": "ديروط"
            },
            {
                "id": "280",
                "state_id": "16",
                "name": "ساحل سليم"
            },
            {
                "id": "281",
                "state_id": "16",
                "name": "شرق"
            },
            {
                "id": "282",
                "state_id": "16",
                "name": "صدفا"
            },
            {
                "id": "283",
                "state_id": "16",
                "name": "غرب "
            },
            {
                "id": "284",
                "state_id": "16",
                "name": "مبني القطاع"
            },
            {
                "id": "285",
                "state_id": "16",
                "name": "منفلوط"
            },
            {
                "id": "286",
                "state_id": "11",
                "name": "ابو قرقاص"
            },
            {
                "id": "287",
                "state_id": "11",
                "name": "العدوة"
            },
            {
                "id": "288",
                "state_id": "11",
                "name": "المنيا شرق"
            },
            {
                "id": "289",
                "state_id": "11",
                "name": "المنيا غرب"
            },
            {
                "id": "290",
                "state_id": "11",
                "name": "بني مزار"
            },
            {
                "id": "291",
                "state_id": "11",
                "name": "ديرمواس"
            },
            {
                "id": "292",
                "state_id": "11",
                "name": "سمالوط"
            },
            {
                "id": "293",
                "state_id": "11",
                "name": "مدينة ملوي"
            },
            {
                "id": "294",
                "state_id": "11",
                "name": "مركز المنيا"
            },
            {
                "id": "295",
                "state_id": "11",
                "name": "مركز ملوي"
            },
            {
                "id": "296",
                "state_id": "11",
                "name": "مطاي"
            },
            {
                "id": "297",
                "state_id": "11",
                "name": "مغاغة"
            },
            {
                "id": "298",
                "state_id": "23",
                "name": "الساحل الشمالي (25 يناير)"
            },
            {
                "id": "299",
                "state_id": "23",
                "name": "السلوم (الشئون التجارية)"
            },
            {
                "id": "300",
                "state_id": "23",
                "name": "الضبعه"
            },
            {
                "id": "301",
                "state_id": "23",
                "name": "العلمين"
            },
            {
                "id": "302",
                "state_id": "23",
                "name": "المنتزة"
            },
            {
                "id": "303",
                "state_id": "23",
                "name": "سيدي براني"
            },
            {
                "id": "304",
                "state_id": "23",
                "name": "سيدي عبدالرحمن"
            },
            {
                "id": "305",
                "state_id": "23",
                "name": "سيوة"
            },
            {
                "id": "306",
                "state_id": "23",
                "name": "مارينا - موزع (ج) - ك 98"
            },
            {
                "id": "307",
                "state_id": "23",
                "name": "مطروح شرق (الشئون الإدارية)"
            },
            {
                "id": "308",
                "state_id": "23",
                "name": "مطروح غرب"
            },
            {
                "id": "309",
                "state_id": "14",
                "name": "قطاع شبكات السويس"
            },
            {
                "id": "310",
                "state_id": "14",
                "name": "هندسة الاربعين"
            },
            {
                "id": "311",
                "state_id": "14",
                "name": "هندسة الجناين"
            },
            {
                "id": "312",
                "state_id": "14",
                "name": "هندسة الخليج"
            },
            {
                "id": "313",
                "state_id": "14",
                "name": "هندسة السويس"
            },
            {
                "id": "314",
                "state_id": "14",
                "name": "هندسة فيصل"
            },
            {
                "id": "315",
                "state_id": "19",
                "name": "الزرقا"
            },
            {
                "id": "316",
                "state_id": "19",
                "name": "جنوب دمياط "
            },
            {
                "id": "317",
                "state_id": "19",
                "name": "شمال دمياط"
            },
            {
                "id": "318",
                "state_id": "19",
                "name": "عزبة البرج"
            },
            {
                "id": "319",
                "state_id": "19",
                "name": "كفر سعد"
            },
            {
                "id": "320",
                "state_id": "19",
                "name": "الروضة"
            },
            {
                "id": "321",
                "state_id": "19",
                "name": "الشعراء"
            },
            {
                "id": "322",
                "state_id": "19",
                "name": "فارسكور"
            },
            {
                "id": "323",
                "state_id": "19",
                "name": "كفر البطيخ"
            },
            {
                "id": "324",
                "state_id": "19",
                "name": "رأس البر"
            },
            {
                "id": "325",
                "state_id": "4",
                "name": "الجمالية"
            },
            {
                "id": "326",
                "state_id": "4",
                "name": "قري السنبلاوين"
            },
            {
                "id": "327",
                "state_id": "4",
                "name": "مدينة السنبلاوين"
            },
            {
                "id": "328",
                "state_id": "4",
                "name": "المطرية"
            },
            {
                "id": "329",
                "state_id": "4",
                "name": "قري المنزلة"
            },
            {
                "id": "330",
                "state_id": "4",
                "name": "مدينة أجا"
            },
            {
                "id": "331",
                "state_id": "4",
                "name": "بني عبيد"
            },
            {
                "id": "332",
                "state_id": "4",
                "name": "تمي الأمديد"
            },
            {
                "id": "333",
                "state_id": "4",
                "name": "جمصه"
            },
            {
                "id": "334",
                "state_id": "4",
                "name": "قري شبين"
            },
            {
                "id": "335",
                "state_id": "4",
                "name": "شرق المنصورة"
            },
            {
                "id": "336",
                "state_id": "4",
                "name": "غرب المنصورة"
            },
            {
                "id": "337",
                "state_id": "4",
                "name": "طلخا"
            },
            {
                "id": "338",
                "state_id": "4",
                "name": "ميت سلسيل"
            },
            {
                "id": "339",
                "state_id": "4",
                "name": "قري ميت غمر"
            },
            {
                "id": "340",
                "state_id": "4",
                "name": "مدينة ميت غمر"
            },
            {
                "id": "341",
                "state_id": "4",
                "name": "نبروة"
            },
            {
                "id": "342",
                "state_id": "4",
                "name": "الستاموني"
            },
            {
                "id": "343",
                "state_id": "4",
                "name": "قري بلقاس"
            },
            {
                "id": "344",
                "state_id": "4",
                "name": "مدينة بلقاس"
            },
            {
                "id": "345",
                "state_id": "4",
                "name": "دكرنس"
            },
            {
                "id": "346",
                "state_id": "4",
                "name": "مدينة شربين"
            },
            {
                "id": "347",
                "state_id": "4",
                "name": "قري المنصورة (1)"
            },
            {
                "id": "348",
                "state_id": "4",
                "name": "قري المنصورة (2)"
            },
            {
                "id": "349",
                "state_id": "4",
                "name": "كوم النور"
            },
            {
                "id": "350",
                "state_id": "4",
                "name": "منية النصر"
            },
            {
                "id": "351",
                "state_id": "5",
                "name": "قطاع شبكات البحر الأحمر"
            },
            {
                "id": "352",
                "state_id": "5",
                "name": "هندسة جنوب الغردقه (المدارس)"
            },
            {
                "id": "353",
                "state_id": "5",
                "name": "هندسة القصير"
            },
            {
                "id": "354",
                "state_id": "5",
                "name": "هندسة راس غارب (الزعفرانه)"
            },
            {
                "id": "355",
                "state_id": "5",
                "name": "هندسة سفاجا"
            },
            {
                "id": "356",
                "state_id": "5",
                "name": "هندسة شمال الغردقه"
            },
            {
                "id": "357",
                "state_id": "5",
                "name": "هندسة مرسي علم"
            },
            {
                "id": "358",
                "state_id": "5",
                "name": "هندسة وسط الغردقه (الاستاد)"
            },
            {
                "id": "359",
                "state_id": "25",
                "name": "ابوتشت"
            },
            {
                "id": "360",
                "state_id": "25",
                "name": "قوص شرق"
            },
            {
                "id": "361",
                "state_id": "25",
                "name": "قفط"
            },
            {
                "id": "362",
                "state_id": "25",
                "name": "قنا غرب"
            },
            {
                "id": "363",
                "state_id": "25",
                "name": "قنا شرق"
            },
            {
                "id": "364",
                "state_id": "25",
                "name": "الوقف"
            },
            {
                "id": "365",
                "state_id": "25",
                "name": "فرشوط"
            },
            {
                "id": "366",
                "state_id": "25",
                "name": "نجع حمادي شمال"
            },
            {
                "id": "367",
                "state_id": "25",
                "name": "نجع حمادي جنوب"
            },
            {
                "id": "368",
                "state_id": "25",
                "name": "نقادة"
            },
            {
                "id": "369",
                "state_id": "25",
                "name": "دشنا"
            },
            {
                "id": "370",
                "state_id": "25",
                "name": "قوص غرب"
            },
            {
                "id": "371",
                "state_id": "17",
                "name": "الفشن"
            },
            {
                "id": "372",
                "state_id": "17",
                "name": "الواسطي"
            },
            {
                "id": "373",
                "state_id": "17",
                "name": "اهناسيا"
            },
            {
                "id": "374",
                "state_id": "17",
                "name": "ببا"
            },
            {
                "id": "375",
                "state_id": "17",
                "name": "ديوان عام قطاع بني سويف"
            },
            {
                "id": "376",
                "state_id": "17",
                "name": "سمسطا"
            },
            {
                "id": "377",
                "state_id": "17",
                "name": "شرق النيل"
            },
            {
                "id": "378",
                "state_id": "17",
                "name": "مدينة بني سويف"
            },
            {
                "id": "379",
                "state_id": "17",
                "name": "مركز بني سويف"
            },
            {
                "id": "380",
                "state_id": "17",
                "name": "ناصر"
            },
            {
                "id": "381",
                "state_id": "7",
                "name": "ابشواي"
            },
            {
                "id": "382",
                "state_id": "7",
                "name": "اطسا شرق"
            },
            {
                "id": "383",
                "state_id": "7",
                "name": "اطسا غرب"
            },
            {
                "id": "384",
                "state_id": "7",
                "name": "ديوان عام قطاع الفيوم"
            },
            {
                "id": "385",
                "state_id": "7",
                "name": "سنورس شرق"
            },
            {
                "id": "386",
                "state_id": "7",
                "name": "سنورس غرب"
            },
            {
                "id": "387",
                "state_id": "7",
                "name": "طامية شرق"
            },
            {
                "id": "388",
                "state_id": "7",
                "name": "طامية غرب"
            },
            {
                "id": "389",
                "state_id": "7",
                "name": "مدينة الفيوم / شمال شرق"
            },
            {
                "id": "390",
                "state_id": "7",
                "name": "مدينة الفيوم / شمال غرب"
            },
            {
                "id": "391",
                "state_id": "7",
                "name": "مدينة الفيوم جنوب"
            },
            {
                "id": "392",
                "state_id": "7",
                "name": "مدينة الفيوم شرق"
            },
            {
                "id": "393",
                "state_id": "7",
                "name": "مدينة الفيوم غرب"
            },
            {
                "id": "394",
                "state_id": "7",
                "name": "يوسف الصديق"
            },
            {
                "id": "395",
                "state_id": "24",
                "name": "اسنا شرق"
            },
            {
                "id": "396",
                "state_id": "24",
                "name": "اسنا غرب"
            },
            {
                "id": "397",
                "state_id": "24",
                "name": "الأقصر غرب"
            },
            {
                "id": "398",
                "state_id": "24",
                "name": "البياضية"
            },
            {
                "id": "399",
                "state_id": "24",
                "name": "الزينية"
            },
            {
                "id": "400",
                "state_id": "24",
                "name": "العديسات"
            },
            {
                "id": "401",
                "state_id": "24",
                "name": "أرمنت"
            },
            {
                "id": "402",
                "state_id": "24",
                "name": "جنوب الأقصر"
            },
            {
                "id": "403",
                "state_id": "24",
                "name": "شمال الأقصر"
            },
            {
                "id": "404",
                "state_id": "1",
                "name": "التجمع الأول"
            },
            {
                "id": "405",
                "state_id": "1",
                "name": "التجمع الخامس"
            },
            {
                "id": "406",
                "state_id": "1",
                "name": "الرحاب القطامية"
            },
            {
                "id": "407",
                "state_id": "2",
                "name": "أكتوبر (1)"
            },
            {
                "id": "408",
                "state_id": "2",
                "name": "أكتوبر (2)"
            },
            {
                "id": "409",
                "state_id": "2",
                "name": "الشيخ زايد "
            },
            {
                "id": "410",
                "state_id": "1",
                "name": "15 - مايو"
            },
            {
                "id": "411",
                "state_id": "3",
                "name": "برج العرب الجديد"
            },
            {
                "id": "412",
                "state_id": "10",
                "name": "مدينة السادات"
            }
            ]';

        foreach (json_decode($entries, true) as $entry) {
            $data = [
                "name" => $entry["name"],
                'state_id' => $entry["state_id"]
            ];
            City::create($data);
        }
    }
}
